spring-boot-soap-example/src/main/resources/user-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:us="http://rakib.example.com/spring.example">
    <soapenv:Header/>
    <soapenv:Body>
        <us:getUserRequest>
            <us:name>Mukesh</us:name>
        </us:getUserRequest>
    </soapenv:Body>
</soapenv:Envelope>